Tekla Open API Reference for Tekla Structures 2025
Hideable.IsHidden Property
 Retrieves the information if this object is hidden or not.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsHidden { get; }
Public ReadOnly Property IsHidden As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Hideable Class
Tekla.Structures.Drawing Namespace